package vertex.lesson5.homework;

/**
 * Created by Юлия on 15.07.2017.
 */
// Циклы
// Задача 2. Написать программу с помощью цикла while, которая выводит числа от 10 до 2.

public class Cycles {

    public static void main(String[] args) {

        int k = 10;
        while(k >= 2) {
            System.out.println(k + " ");
            k--;
        }

    }
}
